app/views/customers/index.html.erb

SELECT  "addresses".* FROM "addresses"  WHERE "addresses"."customer_id" = $1  ORDER BY "addresses"."id" ASC LIMIT 1  [["customer_id", 1]]
---
            <td><%= customer.last_name %></td>
            <td><%= customer.addresses.first.try(:city) %></td>