app/controllers/customers_controller.rb

  def new
    @customer = Customer.new
    @address_types = AddressType.all
---
SELECT "address_types".* FROM "address_types"

  def create
    @customer = Customer.new(customer_params)

    if @customer.save
---
INSERT INTO "customers" ("created_at", "first_name", "last_name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-10-03 09:00:07.492217"], ["first_name", "asd"], ["last_name", "asd"], ["updated_at", "2014-10-03 09:00:07.492217"]]

  def edit
    @address_types = AddressType.all
    get_customer

    @customer.addresses.build  if @customer.addresses.blank?
---
SELECT "address_types".* FROM "address_types"
SELECT "addresses".* FROM "addresses"  WHERE "addresses"."customer_id" = $1  [["customer_id", 10]]